#include <iostream>

int main()
{
	// 게임 자체의 시뮬레이션이 돌아가야함
	// 케릭터 생성 및 아이디 설정
	// 케릭터가 상점을 갈지 전투를 할지 선택할수있어야함
	// 만약 전투를 선택했다면 몬스터를 생성하고 랜덤한 몬스터와 전투를함
	// 전투에서 승리했다면 골드를 얻고 확률적으로 아이템을 습득함
	// 전투에서 패배했다면 체력이 최대체력에 절반인 상대로 리젠되어야함
	// 전투에서 승리한 골드로 상점에서 아이템을 구매 할 수 있어야 하고 구매한 아이템은 인벤토리에 보관되어야함
	// 인벤토리 창을 열면 보관되어있는 아이템이 전부 나열되어야함
	// 인벤토리 내의 아이템을 사용하면 그에 따른 스탯이 증가해야함
	// 상점에서 아이템은 단일, 다수의 갯수를 구매 할 수 있어야함
	// 케릭터가 가지고 있는 아이템을 상점에 판매를 할 수 있어야하고 판매 할땐 일정 퍼센테이지를 떼어 판매되어야함
	// 상점에 판매되고 있는 아이템에 목록을 띄우는 창을 만들어야함
	// 케릭터 레벨에따라 몬스터의 레벨도 변동되어야함
	// 몬스터는 케릭터로부터 받는 데미지를 계산하는 수식이 필요함
	// 몬스터는 죽었다로 판정이 되면 확률에 따라 상점에서 판매하는 아이템을 드랍할 수 있어야 함
	// 전투가 진행되는동안 다수의 몬스터가 아닌 단일 몬스터만 생성되어야함
	// 전투는 턴제 형식으로 몬스터가 공격을 받았다면 다음은 몬스터가 공격할수있어야함
	// 위 내용 번외 - 선공을 할 수 있는 수치가 케릭터와 몬스터에게 둘다 있을수가 있음
	// 보스몬스터는 아직 제외 - 일반 몬스터 구현 후 상의 필요
	
}